Revit 2025 API
RectangularGridSegmentOrientation Enumeration
 The orientation type of rectangular grid segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum RectangularGridSegmentOrientation
Public Enumeration RectangularGridSegmentOrientation
public enum class RectangularGridSegmentOrientation
type RectangularGridSegmentOrientation
Members
Member name | Value | Description
Vertical | 0 |  A vertical GridSegment
Horizontal | 1 |  A horizontal GridSegment
See Also
Reference
Autodesk.Revit.DB Namespace